'use strict';

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert(
      'author',
      [
        {
          id: 1,
          name: 'اومبرتو اکو',
          image_url:
            'http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcSGzQ_9d8LhdQhW--aVy2MM7DC40dNOA4GttMJ0vqsqOCbPWp0oO87tN_9ho5FcdqLrP6L7SxPaSzCCpKU',
          description:
            'اومبرتو اکو در سال ۱۹۳۲ در شهر آلساندریا در استان پیدمونت به دنیا آمد. او نشانه‌شناس، فیلسوف، متخصص قرون وسطی، منتقد ادبی و رمان‌نویس ایتالیایی بود. پدرش جولیو قبل از آن‌که به جنگ جهانی دوم برود، حسابدار بود. در طول جنگ، اومبرتو اکو و مادرش جیووانا در دهکده‌ی کوچکی در کوه‌های پیدمونت زندگی می‌کردند. اومبرتو بعد از جنگ برای مطالعه‌ی فلسفه‌ی قرون وسطی و ادبیات وارد دانشگاه بولونیا شد. در سال ۱۹۵۴ مدرک لیسانس خود را دریافت کرد. او در سال ۱۹۵۶ با بسط دادن تز دکترای خود اولین کتابش را با نام «مسائل اخلاقی سنت توماس» منتشر کرد. اکو پس از گرفتن مدرک دکترا در دانشگاه تورینو، در دانشگاه‌های میلان، فلورانس، بولونیا و کولژ دو فرانس تدریس کرد. کتاب «گشوده» کتابی که با موضوع هنر مدرن در سال ۱۹۶۲ منتشر شد شهرت وی را آغاز نمود.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 2,
          name: 'احمدرضا صالحی‌سیف‌آبادی',
          image_url: 'https://saednews.com/storage/media-center/images/ac-image-KB1659342571uI.png',
          description:
            'احمدرضا صالحی نویسنده‌ی ایرانی است که رمان‌های پرمخاطبی در ژانر فانتزی دارد. او کتاب‌های خود را به هر دو زبان انگلیسی و فارسی منتشر می‌کند. از جمله مهم‌ترین کتاب‌های احمدرضا صالحی می‌توان به مجموعه کتاب‌های «میدگارد» و کتاب «دسیسه عاشقانه» اشاره کرد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 3,
          name: 'اروین د. یالوم',
          image_url:
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSR1JZvmZIR6z_6guEkjVFpV2t0agksrtGZ-hyNizISPxS2ARFn1qI0iyae4KsyrqYc-M&usqp=CAU',
          description:
            'اروین د. یالوم روانپزشک اگزیستانسیال آمریکایی است. او استاد بازنشسته روانپزشکی در دانشگاه استنفورد و همچنین نویسنده روایت‌های واقعی و تخیلی داستانی و آثار فلسفی و روانشناسانه است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 4,
          name: 'جوجو مویز',
          image_url:
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKh-czSzJbAJs19lPOh2eHUf-CxcrZLjwP4f7lE3mQNpbQcEl4ZJLYjWmItn2w5lDRIOE&usqp=CAU',
          description:
            'جوجو مویز در ۴ اکتبر ۱۹۶۹ در میدستون انگلستان به دنیا آمد. در دوران کودکی، مویز کتاب ولوت ملی اثر انید باگنولد را خواند و خواندن این کتاب باعث شد او در دوران کودکی احساس کند می‌تواند به چیزهایی بزرگ‌تر از آن‌چه در آن زمان فکر می‌کرد، دست‌ پیدا کند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 5,
          name: 'هیئون سئو لی',
          image_url: 'https://saednews.com/storage/media-center/images/ac-image-9a1663514695es.jpeg',
          description:
            'هیئون سئو لی نویسنده‌ و فعال حقوق بشر متولد سال ۱۹۸۰ در کره‌شمالی است، حاصل ازدواج اول مادرش است و یک برادر ناتنی دارد، وقتی نوجوان بود پدرش فوت کرد و اداره‌ی زندگی به گردن مادرش می‌افتد، در ۱۷ سالگی به‌خاطر زندگی در نزدیکی مرز چین و کره از روی کنجکاوی کشورش را برای همیشه و برای ساختن زندگی جدیدی ترک می‌کند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 6,
          name: 'محمدعلی جعفری',
          image_url:
            'https://upload.wikimedia.org/wikipedia/commons/6/6f/%D9%85%D8%AD%D9%85%D8%AF%D8%B9%D9%84%DB%8C%28%D8%B9%D8%B2%DB%8C%D8%B2%29_%D8%AC%D8%B9%D9%81%D8%B1%DB%8C.jpg',
          description:
            'محمدعلی جعفری (زادهٔ ۱۰ شهریور ۱۳۳۶ یزد) فرمانده نظامی ایرانی است که هم‌اکنون به‌عنوان فرمانده قرارگاه فرهنگی و اجتماعی بقیةالله الاعظم سپاه پاسداران فعالیت می‌کند.[۴] وی پیش‌تر در فاصله سالهای ۱۳۸۶ تا ۱۳۹۸ فرماندهی کل سپاه پاسداران انقلاب اسلامی را برعهده داشت.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 7,
          name: 'آنیک کوژان',
          image_url:
            'http://t1.gstatic.com/licensed-image?q=tbn:ANd9GcToK_NgnnTNchnfKeGRf-82zRyY3R6F6a5_53Xp8PO3pOWvecDtxhUHRylfu80WugbeepDZYSFWcqJ0iTI',
          description:
            'آنیک کوژان روزنامه‌نگار مجله لو موند است. کوژان در سال‌های پس از انقلاب در لیبی به آن کشور سفر کرده و در ملاقات‌هایی که با افراد مختلف داشته‌است دست به تألیف کتاب حرمسرای قذافی می‌زند. او برنده جایزه‌های باشگاه بین‌المللی مطبوعات برای کتاب حرمسرای قذافی و جایزه «آلبر لوند» برای کتاب عرصه‌ها شده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 8,
          name: 'سیدمحمود زارعی',
          image_url: 'https://abrbook.ir/file/cache/attach/image/202204/61252-9A73D5CD-1BC8-4B98-BA88-463BCABF9D01_459_364.jpg',
          description: 'از فقها دینی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 9,
          name: 'آنتوان دوسنت اگزوپری',
          image_url: 'https://ketabak.org/sites/default/files/person/antoine-de-saint-exupery.jpg',
          description:
            'آنتوان دوسنت اگزوپری، نویسنده و خلبان فرانسوی است که با جاودانه «شازده کوچولو» در تاریخ ادبیات جهان ماندگار شد. او که یک خلبان غیرنظامی موفق در پیش از آغاز جنگ جهانی دوم است، با برافروخته شدن شعله‌های جنگ به نیروی هوایی فرانسه پیوست. اما اشغال زودهنگام و رعدآسای فرانسه توسط قوای نازی، او را بر آن داشت تا به آمریکا برود و به جریانی بپیوندد که می‌کوشید ایالات متحده را مجاب کند تا وارد جنگ شود. سپس باز در جایگاه یک خلبان جنگی به نیروهای ارتش آزادی‌بخش فرانسه پیوست. او در این زمان از نظر سنی برای این کار پرخطر، نسبت به دیگر خلبانان، مسن‌تر و آسیب‌پذیرتر بود. در یکی از پروازهای عملیاتی بر فراز مدیترانه، ناپدید شد و به نظر می‌رسد در همین زمان جان باخته باشد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 10,
          name: 'استیو تولتز',
          image_url: 'https://ketabchi.com/blog/wp-content/uploads/2020/11/%D8%A7%D8%B3%D8%AA%DB%8C%D9%88-%D8%AA%D9%88%D9%84%D8%AA%D8%B2-scaled.jpg',
          description:
            'استیو تولتز در سال ۱۹۷۲ در استرالیا به دنیا آمد. او به دلیل انتشار کتاب جزء از کل در سال ۲۰۰۸ به یکی از بزرگ‌ترین رمان‌نویسان کشور استرالیا تبدیل شد. کتاب جزء از کل بارها و توسط ناشران مختلف به زبان فارسی ترجمه شده است. استیو تولتز برای نوشتن این اثر نامزد جایزه‌ی من‌بوکر شد. او کمی بعد از انتشار و موفقیت کتاب اولش، ریگ روان را منتشر کرد که آن هم با اسقبال خوبی مواجه شد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 11,
          name: 'مهرداد صدقی',
          image_url: 'https://www.chetor.com/wp-content/uploads/2020/09/New-Project-8.jpg',
          description:
            'مهرداد صدقی طنز نویس بجنوردی متولد سال ۱۳۵۶ است. مهرداد در سال ۷۵ در رشته صنایع چوب و کاغذ دانشگاه گرگان پذیرفته شد و در همین دانشگاه مقاطع ارشد و دکترا خود را پشت سر گذاشت. صدقی طنزنویسی را در دوران تحصیل آغاز کرد. اولین اثر منتشر شده از این نویسنده جوان به اولین جشنواره طنز دانشجویان در سال ۷۹ باز می‌گردد. اولین کتاب صدقی با عنوان نقطه ته خط منتشر شد اما اغلب او را با کتاب آبنبات هل‌دار می‌شناسند. از دیگر آثار این نویسنده می‌توان به مغز نوشته‌های یک جنین، مغز نوشته‌های یک نوزاد، رقص با گربه‌ها، تعلیمات غیر اجتماعی، آبنبات پسته‌ای و میرزا روبات، اشاره کرد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 12,
          name: 'جورج اورول',
          image_url: 'https://cdn.fidibo.com/images/content/images/George_Orwellwriter.jpg',
          description:
            'اریک آرتور بلر با نام مستعار جورج ارول در ۲۵ ژوئن ۱۹۰۳ در شهر موتیهاری، بیهار در هند متولد شد. او داستان‌نویس، روزنامه‌نگار، منتقدِ ادبی و شاعر انگلیسی بود که بیشتر برای دو رمان سرشناس و پرفروشش مزرعه حیوانات و رمان ۱۹۸۴ می‌شناسند. هر دوی این کتاب‌ها به وضعیت حکومت‌های دیکتاتوری می‌پردازند. جرج اورول مدتی به عنوان پلیس سلطنتی هند در برمه فعالیت می‌کرد اما زندگی در هند و انگلیس سبب شد تا با فقر آشنا شود و این آشنایی دیدگاهی جدید به او و کارهایش بخشید. کتاب‌های آس و پاس در لندن و پاریس و دختر کشیش حاصل همین تجربیات او هستند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 13,
          name: 'اصغر بهرامی',
          image_url:
            'https://zire100sanjesh.com/wp-content/uploads/2021/11/%D8%A7%D8%B3%D8%AA%D8%A7%D8%AF-%D8%A7%D8%B5%D8%BA%D8%B1-%D8%A8%D9%87%D8%B1%D8%A7%D9%85%DB%8C.jpg',
          description:
            'با بیش از 22 سال سابقه ی درخشان تدریس حرفه ای در برترین مدارس و بزرگ ترین آموزشگاه های کنکور تهران. استاد بهرامی با شیوه ی منحصر به فرد روش آموزش عروض در درس علوم و فنون (ادبیات تخصصی انسانی) شناخته و محبوب شده اند. تدریس عروض با شیوه ی شنیداری و آموزش همراه با موسیقی، یادگیری یکی از سخت ترین مباحث درسی گروه انسانی را برای دانش آموزان دلنشین، ساده و جذاب کرده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 14,
          name: 'امیرحسین قدیانی منفرد',
          image_url: 'https://img.freepik.com/free-photo/handsome-confident-smiling-man-with-hands-crossed-chest_176420-18743.jpg?w=2000',
          description: 'نویسنده حوزه درسی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 15,
          name: 'اشرف پایمزد',
          image_url: 'https://img.freepik.com/free-photo/handsome-confident-smiling-man-with-hands-crossed-chest_176420-18743.jpg?w=2000',
          description: 'نویسنده حوزه درسی',

          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 16,
          name: 'رضا کریمی',
          image_url:
            'https://static1.khoondanionline.com/thumbnail/KjH9Vc2OymXq/9-wZKh4hicXyJvwVQ1c9MgnJ79Dd3XqXIM1JsiCe47NYS6jramGkBPdo-QVEe9EugUH2rgRJG8g,/%D8%B1%D8%B6%D8%A7+%DA%A9%D8%B1%DB%8C%D9%85%DB%8C.jpg',
          description: 'نویسنده حوزه درسی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 17,
          name: 'سیدسعید آریانژاد',
          image_url: 'http://ensani.ir/assets/5d15d464/images/profile-placeholder.jpg',
          description: 'نویسنده حوزه مذهبی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 18,
          name: 'فاطمه عالمی',
          image_url: 'https://nobaan.com/pltfrm/src/pic/MjY4NQ%3D%3D/dGFzdmlyX2RvY3Rvcg%3D%3D/0/0/?did=2685',
          description: 'نویسنده حوزه مذهبی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 19,
          name: 'مرتضی سمیعی نیا',
          image_url: 'http://ensani.ir/assets/5d15d464/images/profile-placeholder.jpg',
          description: 'نویسنده حوزه مذهبی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 20,
          name: 'رضیه غبیشی',
          image_url: 'https://newsmedia.tasnimnews.com/Tasnim/Uploaded/Image/1396/09/16/1396091618200095712716914.jpg',
          description:
            'رضیه غبیشی همسر پاسدار شهید جانباز حاج محمود عطشانی، دارای ۴ فرزند پسر که ۳ تا از فرزندان این خانم نویسنده در بحبوحه ی جنگ به دنیا آمده اند. خانم غبیشی در جنگ به عنوان مترجم و تدارکات و روابط عمومی سپاه فعالیت کرده است. در تاریخ ۷/۱۲/۵۹ ازدواج کرده و به علت محاصره ی شهر به بندر چوئبده رفته و بعد از آن به جزیره مینو رفته و شرو ع به نوشتن خاطرات جنگ کرده، که کتاب منتشر شده از این بانوی نویسنده گنجینه ی رنج می باشد',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 21,
          name: 'جیمز کلیر',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/383c07d643c7475b95e9c93d575684a3.jpg',
          description:
            'جیمز کلیر (متولد ۲۲ ژانویه‌ی ۱۹۸۶) نویسنده، وبلاگ‌نویس و سخنران مشهور آمریکایی است. نوشته‌های کلیر بر موضوعاتی مانند چگونگی شروع کردن عادت‌های خوب (و پایبند ماندن به آن‌ها)، اجتناب از انتخاب‌های بد، انجام کارهای بیشتر در زمان کمتر و نحوه‌ی ایجاد فرآیندهای بهتر متمرکز است و مهم‌تر از همه این است که کلیر در مورد چگونگی پیاده‌سازی این ایده‌ها در زندگی روزمره می‌نویسد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 22,
          name: 'مارک منسون',
          image_url: 'https://www.ketabrah.ir/img/authors/a-16953.jpg',
          description:
            'مارک منسن، در ۹ مارس ۱۹۸۴ در تگزاس متولد شد. منسن از دانشگاه بوستون فارغ‌التحصیل شد. کتاب هنر ظریف رهایی از دغدغه‌ها، اثری بود که برای نویسنده‌اش یعنی مارک منسن شهرت به ارمغان آورد. تا پیش از آن منسن مشغول کار برای وبلاگ خود بود. در حال حاضر او در منهتن نیویورک زندگی می‌کند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 23,
          name: 'تینا سیلیگ',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/fa1abc0486704a3786793939ff696378.jpg',
          description:
            'تینا سیلیگ دکتریِ عصب‌شناسی از دانشکدهٔ پزشکی استنفورد دارد و مدیر اجرایی برنامهٔ سرمایه‌گذاری‌های مخاطره‌آمیزِ فناوریِ استنفورد است که قطب کارآفرینی در دانشکدهٔ مهندسی دانشگاه استنفورد است. به‌علاوه، سیلیگ دوره‌های آموزشی دربارهٔ کارآفرینی و نوآوری را در بخش علوم و مهندسی مدیریت و در مؤسسهٔ طراحی هاسو پلاتنر در دانشگاه استنفورد تدریس می‌کند. او اغلب سخنرانی می‌کند و کارگاه‌های آموزشی‌ای برای مدیران اجرایی در طیف وسیعی از رشته‌های علمی برگزار می‌کند و کتاب‌های علمی محبوبی برای بزرگ‌سالان و کودکان نوشته است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 24,
          name: 'شری آرگو',
          image_url: 'https://www.ketabrah.ir/img/authors/a-38412.jpg',
          description:
            'شری آرگو نویسنده‌ی کتاب‌های پرفروش در حوزه‌ی روان‌شناسی و روابط عاطفی است. اغلب کتاب‌های او در فهرست پرفروش‌های نیویورک تایمز قرار گرفته‌اند. کتاب‌ «چرا مردان عاشق زنان زیرک می‌شوند؟» از جمله مشهورترین کتاب‌های شری آرگو است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 25,
          name: 'نادر ابراهیمی',
          image_url: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSdtqnDUoCL208KzNseCkrhb_yIBIq7tmZNq6H8_KycGXqiMkYA',
          description:
            'نادر ابراهیمی در ۱۴ فروردین ۱۳۱۵ در تهران متولد شد. مادر او هم از لاریجانی‌های مقیم تهران بود. او علاوه بر اینکه در نوشتن رمان و داستان کوتاه فعالیت می‌کرد در زمینه‌های فیلم‌سازی و ترجمه، نیز فعالیت داشته است. نادر تحصیلات مقدماتی خود را در تهران گذراند و پس از گرفتن دیپلم ادبی از دبیرستان دارالفنون، به دانشکده‌ی حقوق رفت. اما این دانشکده را پس از دو سال رها کرد و در رشته‌ی زبان و ادبیات انگلیسی به درجه‌ی لیسانس رسید.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 26,
          name: 'ویکتور فرانکل',
          image_url:
            'http://t0.gstatic.com/licensed-image?q=tbn:ANd9GcTeddt6wiKP0aoUs9cSwm2-4oYKsWxHieFu9r0DpQbyKDIRQ8-xN_VtdeqFmgpL6lFpIlAmn7flgH6rH7Ka6VGlb8I71r-iQZt3l540OP4b',
          description:
            'ویکتور فرانکل با نام کامل ویکتور امیل فرانکل در ۲۶ مارس ۱۹۰۵ در وین به دنیا آمد. فرانکل یکی از بازماندگان اردوگاه‌های کار اجباری آشویتس و داخاو است. او روانپزشک و عصب‌شناس اتریشی بود که به دلیل یهودی بودن، سال‌ها در اردوگاه‌های کار اجباری، زندانی بود. فرانکل پدر و مادر، نامزد و برادرش را در اردوگاه‌های کار اجباری از دست داد و همین به او انگیزه‌ای داد تا معنایی برای زندگی کردن پیدا کند. بعدها، با آزمایش این طرح بر روی مراجعانش، معنادرمانی را طراحی کرد. ویکتور فرانکل مدتی بعد از جنگ جهانی دوم سخنرانی در شهر وین داشت. بعد از مدتی این سخنرانی به یکی دیگر از کتاب‌های او یعنی انسان در جستجوی معنای غایی، تبدیل شده است. ',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 27,
          name: 'نادیا مراد',
          image_url: 'https://upload.wikimedia.org/wikipedia/commons/6/69/Nadia_Murad%2C_2015_%28cropped%29.jpg',
          description:
            'نادیا مراد فعال حقوق بشر و برندهٔ جایزهٔ صلح نوبل است. او دریافت‌کنندهٔ جایزهٔ «حقوق بشر واسلاو هاول» و جایزهٔ «ساخاروف» و اولین «سفیر حسن‌نیت سازمان ملل» در راستای ارج‌نهادن به بازماندگان قاچاق انسان است. این شخصیت افزون‌بر همکاری با «یزدا» (سازمان حقوق ایزدی‌ها) کوشیده است تا داعش را به‌اتهام نسل‌کشی و جنایت علیه بشریت به پای میز محاکمهٔ دادگاه جنایی بین‌المللی بکشاند. نادیا مراد همچنین بنیان‌گذار طرح ابتکاری نادیاست؛ برنامه‌ای که برای کمک به بازماندگان نسل‌کشی و قاچاق انسان برای التیام و بازسازی جوامع خود تخصیص یافته است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 28,
          name: 'رضا امیرخانی',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/f320e76e8e1d469ea444d8fb142b10d7.jpg',
          description:
            'رضا امیرخانی نویسنده‌ی جوان و خوش‌ذوقی است که در دهه‌ی هفتاد شمسی، در حوزه‌ی داستان‌نویسی ادبیات معاصر ایران ظهور کرد. او با انتشار رمان «ارمیا» خود را به مخاطبان داستان فارسی شناساند و با «منِ او»، موقعیت خود را به عنوان نویسنده‌ای شاخص در عرصه‌ی ادبیات داستانی تثبیت کرد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 29,
          name: 'ویل دورانت',
          image_url: 'https://saednews.com/storage/media-center/images/ac-image-tv1635147929Es.jpeg',
          description:
            'ویلیام جیمز دورانت در ۵ نوامبر ۱۸۸۵ در ماساچوست به دنیا آمد. ویل دورانت در ابتدا می‌خواست کشیش شود اما در دانشگاه بیشتر علوم، از زیست‌شناسی گرفته تا تعلیم و تربیت را تجربه کرد. اما بالاخره بعد از خواندن کتاب اخلاقِ اسپینوزا به سراغ فلسفه رفت، آن رشته را تا دکترا ادامه داد و استاد دانشگاه شد و کتاب‌های فلسفی زیادی تألیف کرد. علت شناخته‌شدن ویل دورانت در دنیا، تالیف مجموعه‌ی یازده جلدی تاریخ تمدن است که آن را به همراه همسرش، آریل دورانت نوشت. او برای نوشتن هر فصل از کتاب به گوشه‌ای از دنیا سفر می‌کرد؛ از مصر و ایران تا سیبری و ژاپن. مقصد او برای نوشتن جلد اول کتاب تاریخ تمدن با عنوان «مشرق‌زمین، گهوارهٔ تمدن» بود. بعد چاپ جلد اول، سفرهای دور دنیایش شروع شد که ۵۰ سال ادامه یافت.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 30,
          name: 'ریچارد پل',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/bc8bdc2ff3a841d5a6c9857d1c88fcc8.png',
          description:
            'او بیش از ۲۰ سال دوره‌های ابتدایی و پیشرفته در تفکر انتقادی را در دانشگاه آموخت و برنده جوایز بیشماری از جمله فیلسوف برجسته، توسط شورای مطالعات فلسفی در سال ۱۹۸۷ شده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 31,
          name: 'یوستاین گاآردر',
          image_url:
            'http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcSdvrYTcIBzISZOkAuBFzZEZcdTqOGZRIxsw15Wbw0H50qB-FOxtjhilDqJSrdfnA38OE7AWA-7-WVrPSg',
          description:
            'یوستاین گاآردر نویسنده‌ای نروژی که با کتاب دنیای سوفی مشهور شد، در واقع استاد دانشگاه‌های نروژ بود که بیشتر عمرش را صرف تدریس درس فلسفه و تاریخ عقاید بود و همیشه در تلاش بود تا بتواند مفاهیم فلسفه را به زبان ساده برای جوانان و نوجوانان توضیح دهد. او بسیار تلاش کرد تا کتابی آسان با روایتی روان برای دروس خود پیدا کند، اما موفق نشد. البته کتاب‌های زیادی با موضوع فلسفه وجود دارند که موردنظر او نبود تا اینکه خود شروع به نوشتن کرد، تا بتواند فسلفه را ابتدا برای جوانان و شاگردانش و سپس برای جهانیان جذاب بکند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 32,
          name: 'ویلیام اروین',
          image_url: 'https://neshanak.art/wp-content/uploads/2020/11/william-ervin-author-.jpg',
          description:
            'ویلیام اروین از نویسندگان مطرح و استاد دانشگاه فلسفه در دانشگاه رایت استیت واقع در اوهایو است. او بر روی آثار فیلسوفان بسیار مشهور و نامی و همچنین موضوع فلسفه خالص، تمرکز کرده است. اروین، برخلاف بقیه‌ی فیلسوفان، مخاطبان کتاب‌ها و مقالات خود را تنها بر روی فلاسفه قرار نداده است. او عقیده دارد که کاربرد فلسفه باید برای افرادی باشد که آگاهی کمی از اصل آن دارند و با استفاده از این دانش بتوانند در زندگی خود تغییرات بنیادینی ایجاد کنند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 33,
          name: 'کلی بارن‌هیل',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/d2c7cc4e76b14522b7680e85c573457f.jpg',
          description:
            'کلی ریگن بارن‌هیل، معلم و نویسنده آمریکایی، در سال ۱۹۷۳ متولد شده است. او فارغ‌التحصیل دانشگاه کاترین در ایالت مینه‌سوتا است و پیش از موفقیت در نویسندگی، دوره‌های داوطلبانه آتش‌نشانی را گذرانده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 34,
          name: 'کیت دی کامیلو',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/2e7a52838e624247a18989f04bb500ab.jpg',
          description:
            'کیت دی کامیلو (به انگلیسی: Kate DICamillo) (زاده ۲۵ مارس ۱۹۶۴ در فیلادلفیا) نویسنده اهل ایالات متحده آمریکا است که اکثر آثارش از جمله ببر خیزان جوایز متعددی را کسب کرده‌ است. از سومین نوول دی کامیلو یعنی افسانه دسپراکس، انیمیشنی به همین نام (با صداپیشگی اما واتسون بازیگر نقش هرمیون گرنجر در سری فیلم‌های هری پاتر) ساخته‌ شده‌ است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 35,
          name: 'دانا باربا هیگرا',
          image_url: 'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcS6MGdlFzl6qhvaOQ9JvTi6yefziBAyisFZ2HfVwYQOIfAw93vJ',
          description:
            "دونا باربا هیگورا نویسنده آمریکایی کتاب کودکان است. اولین رمان او، Lupe Wong Won't Dance، کتاب افتخاری جایزه Pura Belpré و برنده PNBA در سال 2021 بود.[1][2] رمان دیستوپیایی درجه متوسط او، آخرین کوئنتیستا، برنده مدال نیوبری 2022 و مدال پورا بلپره شد.",
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 36,
          name: 'کیمبِرلی بروبیکر بردلی',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/d85b803a10b44a099ff380642207fbd0.jpg',
          description:
            'کیمبرلی بروبیکر بردلی (به انگلیسی: Kimberly Brubaker Bradley) (متولد ۲۴ ژوئن ۱۹۶۷) نویسنده کتاب کودک و نوجوان جوان است. کتاب «جنگی که نجاتم داد» جایزه افتخار نیوبری را در سال ۲۰۱۶ دریافت کرد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 37,
          name: 'پدرام حکیم‌زاده',
          image_url: 'http://ensani.ir/assets/5d15d464/images/profile-placeholder.jpg',
          description: 'پدرام حکیم‌زاده متولد سال 1339، مدیر نشر شهر پدرام می باشد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 38,
          name: 'فاطمه شکری فومشی',
          image_url: 'http://ensani.ir/assets/5d15d464/images/profile-placeholder.jpg',
          description: 'نویسنده حوزه هنری',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 39,
          name: 'آین رند',
          image_url: 'https://upload.wikimedia.org/wikipedia/fa/e/e2/Ayn_Rand_by_Talbot_1943.jpg',
          description:
            'آین رَند (به انگلیسی: Ayn Rand) با نام کامل آلیسا زینوفیِونا روزنبام (به روسی: Alisa Zinovyevna Rosenbaum) (۲ فوریهٔ ۱۹۰۵ - ۶ مارس ۱۹۸۲) رمان‌نویس، فیلسوف، نمایشنامه‌نویس و فیلم‌نامه‌نویس روسی – آمریکایی بود. رمانهای پرفروش آین رند همچون سرچشمه و اطلس شورید و نقش او در ایجاد و پیشبرد نظام فلسفی که خود آن را «عینیت‌گرایی» (آبژکتویسم) نام داده بود بیشترین نقش را در شناساندن وی داشته‌اند.[۱] رمان‌های سرچشمه و اطلس شورید مضمون‌هایی فلسفی و همچنین عناصر علمی–تخیلی و رمانتیک دارند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 40,
          name: 'نانسی بیمن',
          image_url: 'https://dehlinks.ir/image/human_14437.jpg',
          description:
            'نانسی بیمن کارگردان، طراح شخصیت، معلم و انیماتور است. وی در برنامه انیمیشن شخصیت ها در CalArts شرکت کرد. در حال حاضر بیمن در بخش انیمیشن کالج Sheridan در کانادا، استوری داستانی را آموزش می دهد. بیمن پیش از این انیمیشن را در کالج هنر و طراحی ساوانا تدریس می کرد و از سال 2004 تا 2008 انیمیشن، طراحی شخصیت، چیدمان، صفحه داستانی و نقاشی ژست را در انستیتوی فناوری روچستر، دانشکده فیلم و انیمیشن تدریس می کرد. بیمن نویسنده دو کتاب در زمینه بازیگری انیمیشن و صفحه داستانی است: آماده شدن برای هیئت مدیره! و عملکرد متحرک. مصاحبه های وی با هنرمندان انیمیشن از سال 1982 تا 1995 در مجله Cartoonist Profiles منتشر شد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 41,
          name: 'آرتور کانن دویل',
          image_url:
            'https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Portrait_of_Arthur_Conan_Doyle.jpg/220px-Portrait_of_Arthur_Conan_Doyle.jpg',
          description:
            'سر آرتور ایگناتیوس کانن دویل در سال ۱۸۵۹ در شهر ادینبورگ در اسکاتلند متولد شد. پدرش، چارلز آلتمتون دویل در انگلستان زاده شد. پدر و مادر دویل هر دو از نژاد کاتولیک ایرلندی بودند و در سال ۱۸۵۵ ازدواج کردند. در سال ۱۸۶۴، خانواده دویل به دلیل اعتیاد به الکل پراکنده شدند و کودکان به‌طور موقت در ادینبورگ ساکن شدند. در سال ۱۸۶۷ خانواده توانست دوباره جمع شود زندگی را از سر بگیرد. دویل پدر خود را در سال ۱۸۹۳ از دست داد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 42,
          name: 'سعید محمدحسنی',
          image_url: 'https://piadero.ir/app/files/posts/thumb/1_60cc6daa9cb6d.jpeg',
          description:
            'سعید محمدحسنی، شاعری است که تا سال ۱۳۷۲ بیشتر در قالب‌های کلاسیک به ویژه غزل، دوبیتی و مثنوی شعر سروده؛ هر چند که در قالب نیمایی نیز اشعاری داشته است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 43,
          name: 'پلینیو مندوزا',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/5d184ece98014cf8a0c22220175e55d0.jpg',
          description:
            'پلینیو مندوزا، زاده ی سال 1932، روزنامه نگار، نویسنده و دیپلمات کلمبیایی است.مندوزا در شهر تونخا به دنیا آمد. او در دانشگاه سوربون پاریس به تحصیل در رشته ی علوم سیاسی پرداخت. مندوزا به خاطر دوستی نزدیکش با گابریل گارسیا مارکز در دنیای ادبیات لاتین شناخته شده است. او به عنوان اولین مسئول سفارت کلمبیا در فرانسه فعالیت کرد و پس از بازگشت به کشورش در سال 1959، به نویسندگی تمام وقت و روزنامه نگاری روی آورد.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 44,
          name: 'محمدکاظم کاظمی',
          image_url: 'https://media.khabaronline.ir/d/2021/08/19/3/5597816.jpg',
          description:
            'محمدکاظم کاظمی (زادهٔ ۱۳۴۶، هرات) شاعر و نویسندۀ افغانستانی است. کاظمی عضو گروه علمی برون‌مرزی فرهنگستان زبان و ادب فارسی می‌باشد.[۱]وی در سال ۱۳۹۵ به عنوان دبیر علمی یازدهمین جشنوارۀ شعر فجر انتخاب شد.[۲] او برگزیدۀ نخستین دورۀ جشنواره بین‌المللی شعر فجر در بخش فارسی‌زبانان بود.[۳]',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 45,
          name: 'شرمن الکسی',
          image_url: 'https://upload.wikimedia.org/wikipedia/commons/d/df/Sherman_alexie_2007.jpg',
          description:
            'شرمن الکسی رمان‌نویس، داستان‌کوتاه‌نویس، شاعر و فیلم‌نامه‌نویس سرخ‌پوست است که تاکنون ۱۷ کتاب منتشر کرده است. الکسی برندهٔ جایزهٔ قلم همینگوی سال ۹۳ است. رمان برجستهٔ او به نام خاطرات صد در صد واقعی یک سرخپوست پاره وقت را انتشارات لیتل براون در سال ۲۰۰۷ چاپ کرد. داستان «تو گرو بگذار، من پس می‌گیرم» نخستین بار در آوریل ۲۰۰۳ در مجلهٔ نیویورکر و سپس در مجموعه داستان‌های برگزیدهٔ جایزهٔ او. هنری در سال ۲۰۰۵ منتشر شده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 46,
          name: 'آن‌ماری سلینکو',
          image_url: 'https://www.laklakbook.com/images/Writers/2019-08-19_01-35-40_248.jpg',
          description:
            'آن ماری سلینکو نویسنده‌ای اتریشی است که یکی از برترین رمان‌های دنیا را خلق کرد و اغلب فارسی‌زبان‌ها رمان دزیره‌ از او را با ترجمه‌ی «ایرج پزشکزاد» در خاطرشان دارند. این نویسنده‌ در رمان‌هایش بیشتر به دنیای زنان پرداخت و شخصیت اصلی آثار او زن هستند، اما بر خلاف تصوری که داریم، در آثار باارزش سلینکو سیاست، تاریخ و اجتماع فراموش یا انکار نشده‌اند.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 47,
          name: 'محمدعلی حبیب اللهیان',
          image_url: 'https://rasanews.ir/Original/1397/03/06/IMG16005912.jpg',
          description: 'حجت الاسلام محمدعلی حبیب اللهیان، نویسنده و پژوهشگر حوزوی',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 48,
          name: 'میلاد حبیبی',
          image_url: 'https://www.shereheyat.ir/sites/default/files/styles/poet_80_80/public/upload/poets/habibi.jpg?itok=kUeyQ69i',
          description:
            'میلاد حبیبی  ۲۸ شهریور ۱۳۷۳ در اصفهان متولد شد. او از کودکی به شعر و ادبیات علاقه‌مند بود و اولین سروده‌هایش به همان دوران باز می‌گردد. وی فارغ‌التحصیل رشتۀ حسابداری در مقطع کارشناسی است. حبیبی علاوه بر شعر کلاسیک در عرصه ترانه و نوحه نیز فعالیت دارد. از موفقیت‌های او برگزیده شدن در کنگره‌های ملی شعر است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 49,
          name: 'استیو بیدولف',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/5e51f664d6474d218608d3ef4162722d.jpg',
          description:
            'استفان جان بيدالف متولد 15 آگوست 1953 در سالت برن انگلیس ، نویسنده ، فعال و روانشناس استرالیایی است که کتاب های پرفروش و تأثیرگذاری نوشته است. او در سراسر جهان در مورد والدین و تحصیلات پسران سخنرانی کرده است. ',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 50,
          name: 'اسپنسر جانسون',
          image_url: 'https://www.ketabrah.ir/img/authors/a-1205.jpg',
          description:
            'اسپنسر جانسون نویسنده‌ی آمریکایی است که احتمالا کتابش از خودش شهرت بیشتری دارد! جانسون در سال ۱۹۹۸ کتابی به نام چه کسی پنیر مرا جابه‌جا کرد را در آمریکا منتشر کرد که در بدبینانه‌ترین حالت ۲۸ میلیون نسخه از این کتاب در جهان فروش رفت و به ۲۵ زبان دنیا ترجمه شد، این اتفاق برای کتابی که کمتر از ۱۰۰ صفحه دارد، در هر زمانه‌ای تحسین‌برانگیز است!',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 51,
          name: 'کوین لمن',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/929cf8a1a3704b6fa159a8a36372413c.jpg',
          description:
            'دکتر کوین لمن متولد 1 سپتامبر 1943 ، روانشناس ، شخصیت رادیویی و تلویزیونی ، مربی ، گوینده و نویسنده بیش از 45 کتاب در زمینه والدین ، ​​ازدواج و زندگی خانوادگی ، در سطح بین المللی شناخته شده است و با روانشناسی و شوخ طبعی خود ، مخاطبان را در سراسر جهان تدریس و سرگرم کرده است.',
          created_at: new Date(),
          updated_at: new Date(),
        },
        {
          id: 52,
          name: 'مارابل مورگان',
          image_url: 'https://www.iranketab.ir/Images/ProfileImages/5dfd4877fe1c4e7caa02aa1ea1b26a64.jpg',
          description:
            'مارابل مورگان (کرستلین، اوهایو، 25 ژوئن 1937) یک نویسنده آمریکایی از کتابهای خودیاری برای زنان متاهل است، از جمله کتاب های وی می توان به The Total Woman (1973) ، Total Joy (1983) ، The Total Woman Cookbook (1980) و The Electric Woman. (1986) اشاره کرد. کتاب «زن کامل» بیش از 10 میلیون نسخه فروخت و پرفروش ترین کتاب غیرداستانی سال 1974 بود. این کتاب که در مبنای مسیحیت انجیلی بنا شده است. شاید به بهترین وجه به یاد داشته باشید که به همسرشان می آموزد که از مردان خود در درب جلو سلام کنند و لباسهای سکسی به تن کنند. مورگان نوشت : این تنها زمانی است که یک زن زندگی خود را به همسر خود تسلیم کند، او را تکریم و عبادت می کند و حاضر به خدمت به او می شود، که او برای او واقعاً زیبا می شود.',
          created_at: new Date(),
          updated_at: new Date(),
        },
      ],
      {},
    );
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete('author', { id: Array.from({ length: 52 }, (_, i) => i + 1) }, {});
  },
};
